Revit 2026 API
StructuralConnectionHandlerType.Create Method
Overload List
Name | Description
Create(Document, String, Guid, String) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId, IList<ConnectionInputPointInfo>)
Top
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace